export const タイプ色: Record<string, string> = {
  ノーマル: '#A8A878',
  ほのお: '#F08030',
  みず: '#6890F0',
  でんき: '#F8D030',
  くさ: '#78C850',
  こおり: '#98D8D8',
  かくとう: '#C03028',
  どく: '#A040A0',
  じめん: '#E0C068',
  ひこう: '#A890F0',
  エスパー: '#F85888',
  むし: '#A8B820',
  いわ: '#B8A038',
  ゴースト: '#705898',
  ドラゴン: '#7038F8',
  あく: '#705848',
  はがね: '#B8B8D0',
  フェアリー: '#EE99AC',
};

export const 効果ラベル: Record<2 | 0.5 | 0, string> = {
  2: 'ばつぐん',
  0.5: 'いまひとつ',
  0: 'こうかなし',
};

export const 効果記号: Record<2 | 0.5 | 0, string> = {
  2: '◎',
  0.5: '△',
  0: '×',
};
